<template>
    <section class="ruleDetails">
        <TrayHeader :title="title" />
        <div class="scroX">
            <scroller lock-x ref="scroller" height="100%">
                <div>
                    <!--时时彩-->
                    <ol class="list" v-if="gameId == 10 || gameId == 11 || gameId == 12">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section>
                                <p v-if="gameId == 10">该游戏的投注时间、开奖时间和开奖号码与重庆时时彩完全同步，北京时间（GMT+8）每天白天从上午10:00开到晚上22:00(每10分钟一期，共72期)；夜场从22:00至凌晨2点(每5分钟一期，共48期)；每天开奖共120期。</p>
                                <p v-if="gameId == 11">该游戏全天24小时开奖，每一分钟一期，全天共1440期。</p>
                                <p v-if="gameId == 12">该游戏全天24小时开奖，每三分钟一期，全天共480期。</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong>一、【猜数字】</strong>
                                <p>· 第一球 ~ 第五球：第一球、第二球、第三球、第四球、第五球：指下注的每一球与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码8，下注第一球为8者视为中奖，其余情形视为不中奖。</p>
                            </section>
                            <section>
                                <strong>二、【猜双面】</strong>
                                <p>· 大小：根据相应单项投注的第一球 ~ 第五球开出的球号「大于」或「等于」5为大，「小于」或「等于」4为小。</p>
                                <p>· 单双：根据相应单项投注的第一球 ~ 第五球开出的球号为「双数」叫双--如2、6；球号为「单数」叫单--如1、3。</p>
                                <p>· 质合：根据相应单项投注的第一球 ~ 第五球开出的球号为「1、2、3、5、7」时为「质数」，若为「0、4、6、8、9」时为「合数」，当投注位数质合与开奖结果的位数质合相符时，即为中奖。</p>
                            </section>
                            <section>
                                <strong>三、【猜总和】</strong>
                                <p>· 总和大小：根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值「大于」或「等于」23为「总和大」，「小于」或「等于」22为「总和小」。</p>
                                <p>· 总和单双：根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值是「双数」为「总和双」，数字总和值是「单数」为「总和单」。</p>
                            </section>
                            <section>
                                <strong>四、【猜龙虎】</strong>
                                <p>· 龙：开奖第一球(万位)的号码「大于」第五球(个位)的号码。如：第一球开出6，第五球开出2、第一球开出8，第五球开出6、第一球开出5，第五球开出1...开奖为「龙」，投注龙者视为中奖，其它视为不中奖。</p>
                                <p>· 虎：开奖第一球(万位)的号码「小于」第五球(个位)的号码。如：第一球开出2，第五球开出6、第一球开出6，第五球开出8、第一球开出1，第五球开出5...开奖为「虎」，投注虎者视为中奖，其它视为不中奖。</p>
                                <p>· 和：开奖第一球(万位)的号码「等于」第五球(个位)的号码。如：2XXX2、6XXX6、8XXX8...开奖为「和」，投注和者视为中奖，其它视为不中奖。</p>
                            </section>
                        </li>
                    </ol>
                    <!--赛车pk10-->
                    <ol class="list" v-if="gameId == 20 || gameId == 21 || gameId == 22 || gameId == 23">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section>
                                <p v-if="gameId == 20">北京PK10：是经国家财政部批准，由北京福利彩票发行承销的中国福利彩其中一种；每期开奖车号共十个, 设有大小单双、猜车号，猜龙虎、猜庄闲，猜冠亚，冠亚和，六种玩法。<br/> 开奖时间：「白场」快乐赛车为每天上午 09:30 ~ 晚上23:50止；每期20分钟，共44期，等待开奖时间约为1分钟，与官网完全同步。</p>
                                <p v-if="gameId == 21">开奖时间：全天24小时开奖，每三分钟一期，全天共480期。</p>
                                <p v-if="gameId == 22">该游戏全天24小时开奖，每一分钟一期，全天共1440期。</p>
                                <p v-if="gameId == 23">幸运飞艇：是马耳他共和国瓦莱格福利联合委员会独家发行的一款高频彩；每期开奖号码共十个, 设有大小单双、猜车号，猜龙虎、猜庄闲，猜冠亚，冠亚和，六种玩法。<br/>开奖时间：「白场」幸运飞艇为每天下午 01:05 ~ 次日凌晨04:00止；每五分钟开奖一期，每次竞猜时间约160秒，等待开奖时间约为1分钟，与官网完全同步。</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong>一、【大小单双】</strong>
                                <p>· 1~10名猜大小单双：第一名~第十名车号：开出之号码大于或等于6为大，小于或等于5为小。开出的号码偶数为双，号码奇数为单。</p>
                                <p>· 1~10名猜组合：竞猜内容为「大单」「小双」「小单」「大双」，共4种。</p>
                            </section>
                            <section>
                                <strong>二、【猜车号】</strong>
                                <p>· 每一个车号为一竞猜组，开奖结果「竞猜车号」对应所猜「车道」视为中奖，其余情形视为不中奖。</p>
                            </section>
                            <section>
                                <strong>三、【猜龙虎】</strong>
                                <p>· (1) 第一名vs第十名，(2) 第二名vs第九名，(3) 第三名vs第八名，(4) 第四名vs第七名，(5) 第五名vs第六名，前比后大为龙，反之为虎。</p>
                            </section>
                            <section>
                                <strong>四、【猜庄闲】</strong>
                                <p>· 冠军车号「大于」亚军车号为庄，反之为闲。</p>
                            </section>
                            <section>
                                <strong>五、【猜冠亚】</strong>
                                <p>· 猜冠军及亚军车号，每次竞猜2个号码，顺序不限。</p>
                            </section>
                            <section>
                                <strong>六、【冠亚和】</strong>
                                <p>· 冠亚和值(特码)猜大小单双：冠军车号+亚军车号 = 冠亚和值 = 特码 = 数字3~19，冠亚和值大于或等于12为大，小于或等于11为小。开出的号码偶数为双，号码奇数为单。</p>
                                <p>· 冠亚和值(特码)猜数字：冠亚和值」为「特码」可能出现的结果为3~19，竞猜中对应「冠亚和值」数字的视为中奖，其余视为不中奖。</p>
                                <p>· 冠亚和值(特码)猜区段：特码3~7为A段，8~14为B段，15~19为C段。</p>
                            </section>
                        </li>
                    </ol>
                    <!--幸运28-->
                    <ol class="list" v-if="gameId == 30 || gameId == 31">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section v-if="gameId == 30">
                                <p>幸运28游戏是基于北京快乐8点竞猜游戏。开奖号码为三个(0-9)中随机产生的数字之和，总共有28 种结果(0-27)。这28个号码，押中即可获得奖励。每天从早上9:05至23:55每5分钟一期。虽然游戏本身规则很简单，但由于每期都有几万人一起投注，而且投注的号码和金蛋各不相同，所以每个号码会有不同赔率。</p>
                                <p>幸运28是根据什么开奖的?</p>
                                <p>幸运28开奖结果来源于国家福利彩票北京快乐8开奖号码，从早上9:05至23:55,每5分钟一期不停开奖。北京快乐8每期开奖共开出20个数字，幸运28将这20个开奖号码按照由小到大的顺序依次排列; 取其1-6位开奖号码相加，和值的末位数作为幸运28开奖第一个数值; 取其7-12位开奖号码相加，和值的末位数作为幸运28开奖第二个数值，取其13-18位开奖号码相加，和值的末位数作为幸运28开奖第三个数值; 三个数值相加即为幸运28最终的开奖结果。</p>
                                <p style="padding-top: 2vw;">幸运28玩法说明?</p>
                                <p>· 幸运28采用北京快乐8数据，开奖时间从早上9点05分至OO点OO分每5分钟一期。</p>
                                <p>· 例如:快乐8第”641841”期数据从小到大排序：</p>
                                <p>01,03,13,16,23,27,40,41,45,49,53,54,57,62,67,68,71,72,78</p>
                                <p>第一区[第1/2/3/4/5/6位数字]1,3,13,16,23,27，计算：1+3+13+16+23+27 = 83，结果为3</p>
                                <p>第二区[第7/8/9/10/11/12位数字]40,41,45,49,53,54，计算27+40+41+45+49+53+54 = 282，结果为2</p>
                                <p>第三区[第13/14/15/16/17/18位数字]57,62,63,67,68,71，计算: 57+62+63+67+68+71= 388，结果为8，最终游戏开奖为: 3+2+8=13</p>
                            </section>
                            <section v-if="gameId == 31">
                                <p>加拿大28采用加拿大彩票公司BCLC开奖数据（BCLC官网:lotto.bclc.com）。每三分半钟开一期，每天维护时间为: 晚上20:OO点到21:30点，周一可能会有延迟。为了方便玩家可以更快更直观的了解当期的计算和结果，我们在导航上设置了开奖数据，每期实时更新!</p>
                                <p>加拿大28是根据什么开奖的?</p>
                                <p>加拿大彩票公司BCLC彩每期开奖共开出20个数字。加拿大28将这20个开奖号码按照由小到大的顺序依次排列; 取其第 2/5/8/11/14/17 位开奖号码相加，和值的末位 数作为加拿大28开奖第一个数值; 取其第3/6/9/12/15/18位开奖号码相加，和值的未位数作为加拿大开奖第二个数值，取其第 4/7/10/13/16/19 位开奖号码相加，和值的末位数作为加拿大28开奖第三个数值; 三个数值相加即为加拿大28最终的开奖结果。</p>
                                <p style="padding-top: 2vw;">加拿大28玩法说明?</p>
                                <p>· 例如:加拿大BCLC第”1749110”期数据从小到大排序：</p>
                                <p>7,8,14,16,17,22,26,34,39,41,42,48,54,58,6,6,69,79</p>
                                <p>第一区[第2/5/8/11/14/17位数字] 8,17,34,42,58,69，计算：8+17+34+42+58+69= 228，结果为8</p>
                                <p>第二区[第3/6/9/12/15/18位数字] 14,22,39,48,63,72，计算：14+22+39+48+63+72= 258，结果为8</p>
                                <p>第三区[第4/7/10/13/16/19位数字] 16,26,41,54,64,73，计算: 16+26+41+54+64+73= 274，结果为4，最终游戏开奖为: 8+8+4=20</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong v-if="gameId == 30">幸运28共有几种玩法</strong>
                                <strong v-if="gameId == 31">加拿大28共有几种玩法</strong>
                                <p>1、【大，小，单，双】</p>
                                <p>2、【小单，小双，大单，大双】</p>
                                <p>3、【极小值(0-5)，极大值(22-27)4、28个号码定位】</p>
                            </section>
                            <section>
                                <strong v-if="gameId == 30">幸运28走势图怎么看</strong>
                                <strong v-if="gameId == 31">加拿大28走势图怎么看</strong>
                                <p v-if="gameId == 30">由于幸运28开奖为随机开奖，为了方便蛋友分析幸运28开奖走势，特别针对近期开奖结果进行走势分析展示，以供蛋友参考。统计数据: 统计多少期内的开奖数据(当前统计近200期的开奖数据)</p>
                                <p v-if="gameId == 31">由于加拿大28开奖为随机开奖，为了方便蛋友分析加拿大28开奖走势，特别针对近期开奖结果进行走势分析展示，以供蛋友参考。 统计数据: 统计多少期内的开奖数据。</p>
                                <p>标准间隔: 在标准概率下，间隔多少期会出现这个开奖号码</p>
                                <p>当前间隔: 当前实际开奖数 据中，离最近一次出现该号码间隔了多少期</p>
                                <p>标准次数: 在统计期数内，标准概率下，开奖出现该号码的次数</p>
                                <p>当前次数: 在统计期数内，实际开奖出现该号码的次数 </p>
                            </section>
                        </li>
                    </ol>
                    <!--六合彩-->
                    <ol class="list" v-if="gameId == 70 || gameId == 71">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section>
                                <p v-if="gameId == 70">该游戏的投注时间、开奖时间和开奖号码与香港六合彩完全同步，每周二、周四、周六晚上9:30准时开奖。</p>
                                <p v-if="gameId == 71">开奖时间：全天24小时开奖，每五分钟一期，全天共288期。</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong>一、【特码(特A、特B)】</strong>
                                <span>· [特别号码]：</span>
                                <p>香港彩公司当期开出的最后一码为特码；特码大小：开出之特码大于或等于25为「特码大」，小于或等于24为「特码小」；特码单双：特码为双数叫「特双」，如2、18；特码为单数叫「特单」，如17、33。</p>
                                <span>· [特码值]：</span>
                                <p>开出特码的值对应竞猜号码视为中奖，特码值范围为「1~49」。</p>
                                <span>· [特码大小]：</span>
                                <p>开出之特码大于或等于25为「特码大」，小于或等于24为「特码小」，49为「和」。</p>
                                <span>· [特码单双]：</span>
                                <p>开出之特码为偶数叫「特双」，为奇数叫「特单」，49为「和」。</p>
                                <span>· [特码波色]：</span>
                                <p>开出之特码所属的颜色：</p>
                                <p>01，02，07，08，12，13，18，19，23，24，29，30，34，35，40，45，46 为「红波」，</p>
                                <p>03，04，09，10，14，15，20，25，26，31，36，37，41，42，47，48 为「蓝波」，</p>
                                <p>05，06，11，16，17，21，22，27，28，32，33，38，39，43，44，49 为「绿波」。</p>
                                <span>· [特码尾数大小]：</span>
                                <p>特尾小(0-4)：开出之特码尾数，特尾大(5-9)：开出之特码尾数，49号为和局。</p>
                                <span>· [特码合大小单双]：</span>
                                <p>开出的特码的个位数加上十位数之和为奇数称「合数单」，之和为偶称「合数双」，其中号码49为「和」。例如：合数单，01为0+1=1，23为2+3=5；合数双，28为2+8=10，39为3+9=12；49为和；合大：特码两个数相加大于等于7，例如18；合小:特码两个数相加小于等于6，例如15。</p>
                                <span>· [家禽]：</span>
                                <p>牛、马、羊、鸡、狗、猪。</p>
                                <span>· [野兽]：</span>
                                <p>鼠、虎、兔、龙、蛇、猴。</p>
                                <span>· [特码分段]：</span>
                                <p>49个号码分为5段，A（1-10）、B（11-20）、C（21-30）、D（31-40）、E（41-49），下注的分段与开出特码对应的段相同，为中奖；其余为不中；如：特码是5，下注分段是A段，视为中奖。</p>
                            </section>
                            <section>
                                <strong>二、【正码(正A、正B)】</strong>
                                <span>· [正码]：</span>
                                <p>香港彩公司当期开出之前6个号码叫正码。第一时间出来的叫正码1，依次叫正码2、正码3……正码6，不以大小排序。</p>
                                <span>· [正码值]：</span>
                                <p>开奖号码前6个号码的值包含竞猜号码视为中奖，正码值范围为「1~49」。</p>
                                <span>· [总和大小]：</span>
                                <p>所有七个开奖号码的分数总和大于或等于175为「总和大」；分数总和小于或等于174为「总和小」。如开奖号码为01、07、15、29、38、46、24，分数总和是160，为「总和小」。</p>
                                <span>· [总和单双]：</span>
                                <p>所有七个开奖号码的分数总和是单数叫「总和单」，如分数总和是103、193；分数总和是双数叫「总和双」，如分数总和是108、160。</p>
                                <span>· [总尾大小]：</span>
                                <p>所有七个开奖号码的总分尾数为「5-9」叫「总尾大」，如分数总和是106、197；总分尾数为「0-4」叫「总尾小」，如分数总和是101、164。</p>
                                <span>· [龙虎]：</span>
                                <p>在7个球中：第1个的号码大于第7个球的号码叫「龙」；反之，第7个球的号码大于第1个球的号码叫「虎」。</p>
                            </section>
                            <section>
                                <strong>三、【正特】</strong>
                                <span>· [正1特~正6特]：</span>
                                <p>正1特、正2特、正3特、正4特、正5特、正6特:指下注的正码特与现场滚波开出之正码其开奖顺序及开奖号码相同，视为中奖，例如：现场开奖第三个正码为29号，下注第三个正码特为29则视为中奖，其它号码视为不中奖，其他正特项目依此类推。</p>
                                <span>· [正特尾数大小]：</span>
                                <p>正1特、正2特、正3特、正4特、正5特、正6特的尾数大小：若正码尾数开出「0-4」为「尾小」，开出号码是第一球，则为正1特尾小；若正码尾数开出「5-9」为「尾大」，开出号码是第二球，则为正2特尾大；下注与其对应的号码相同，则为中奖，其余为不中奖，如：正1特开出为32，下注为正1码尾大，则不中；开出正码号码为49则为「和」，不计算结果。</p>
                                <span>· [正特大小]：</span>
                                <p>正1特、正2特、正3特、正4特、正5特、正6特的大小：开出之正特数大于或等于25为「特码大」，小于或等于24为「特码小」；49为「和」，不计算结果。</p>
                                <span>· [正特单双]：</span>
                                <p>正1特、正2特、正3特、正4特、正5特、正6特的单双：开出之正特数为双数叫「特双」，如2、18；特码为单数叫「特单」，如17、33；49为「和」，不计算结果。</p>
                                <span>· [正特合单双]：</span>
                                <p>正1特、正2特、正3特、正4特、正5特、正6特的合数单双：指开出的特码的个位数加上十位数之和为奇数称「合数单」，之和为偶称「合数双」，其中号码49为「和」。例如：合数单，01为0+1=1，23为2+3=5；合数双，28为2+8=10，39为3+9=12；49为和，不计算结果。</p>
                                <span>· [正特波色]：</span>
                                <p>指开出之正码所属的颜色。</p>
                                <p>01，02，07，08，12，13，18，19，23，24，29，30，34，35，40，45，46 为「红波」，</p>
                                <p>03，04，09，10，14，15，20，25，26，31，36，37，41，42，47，48 为「蓝波」，</p>
                                <p>05，06，11，16，17，21，22，27，28，32，33，38，39，43，44，49 为「绿波」。</p>
                            </section>
                            <section>
                                <strong>四、【连码】</strong>
                                <span>· [三中二]：</span>
                                <p>所投注的每三个号码为一组合：若其中2个是开奖号码中的正码，视为中奖，叫「三中二」；若3个都是开奖号码中的正码，叫「三中二之中三」，其余情形视为不中奖；如03、04、05为一组合，开奖号码中有03、04两个正码，没有05，叫「三中二」，按三中二赔率赔付；如开奖号码中有03、04、05三个正码，叫「三中二之中三」，按中三赔率赔付；如出现1个或没有，视为不中奖。</p>
                                <span>· [三全中]]：</span>
                                <p> 每三个号码为一组合：若三个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如03、04、05三个都是开奖号码之正码，视为中奖，如两个正码加上一个特码视为不中奖。</p>
                                <span>· [二全中]：</span>
                                <p>每二个码号为一组合：二个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖（含一个正码加一个特码之情形）。</p>
                                <span>· [二中特]：</span>
                                <p>每二个号码为一组合：二个号码都是开奖号码之正码，叫「二中特之二中」，按二中特之二赔率赔付；若其中一个是正码，一个是特别号码，叫「二中特之中特」，按二中特之中特赔率赔付；其余情形视为不中奖。</p>
                                <span>· [特串]：</span>
                                <p>每二个号码为一组合，其中一个是正码，一个是特码，视为中奖，其余情形视为不中奖（含二个号码都是正码之情形）。</p>
                            </section>
                            <section>
                                <strong>五、【特码半波】</strong>
                                <p>· 指7个开奖号码中含有所属尾数的一个或多个号码，不论同尾数的号码出现一个或多个。</p>
                                <p>[红单] 01，07，13，19，23，29，35，45</p>
                                <p>[红双] 02，08，12，18，24，30-，34，40，46</p>
                                <p>[红大] 29，30，34，35，40，45，46</p>
                                <p>[红小] 01，02，07，08，12，13，18，19，23，24</p>
                                <p>[红合单] 01，07，12，18，23，29，30，34，45</p>
                                <p>[红合双] 02，08，13，19，24，35，40，46</p>
                                <p>[绿单] 05，11，17，21，27，33，39，43</p>
                                <p>[绿双] 06，16，22，28，32，38，44</p>
                                <p>[绿大] 27，28，32，33，38，39，43，44</p>
                                <p>[绿小] 05，06，11，16，17，21，22</p>
                                <p>[绿合单] 05，16，21，27，32，38，43</p>
                                <p>[绿合双] 06，11，17，22，28，33，39，44</p>
                                <p>[蓝单] 03，09，15，25，31，37，41，47</p>
                                <p>[蓝双] 04，10，14，20，26，36，42，48</p>
                                <p>[蓝大] 25，26，31，36，37，41，42，47，48</p>
                                <p>[蓝小] 03，04，09，10，14，15，20</p>
                                <p>[蓝合单] 03，09，10，14，25，36，41，47</p>
                                <p>[蓝合双] 04，15，20，26，31，37，42，48</p>
                            </section>
                            <section>
                                <strong>六、【尾数】</strong>
                                <p>· 以特码色波和特码单双大小为一个投注组合，当开出特码符合投注组合，即视为中奖。若开出特码为49号时，所有投注半波任一个组合视为和局，其余情况视为不中奖。</p>
                                <p>[0尾] 10，20，30，40</p>
                                <p>[1尾] 01，11，21，31，41</p>
                                <p>[2尾] 02，12，22，32，42</p>
                                <p>[3尾] 03，13，23，33，43</p>
                                <p>[4尾] 04，14，24，34，44</p>
                                <p>[5尾] 05，15，25，35，45</p>
                                <p>[6尾] 06，16，26，36，46</p>
                                <p>[7尾] 07，17，27，37，47</p>
                                <p>[8尾] 08，18，28，38，48</p>
                                <p>[9尾] 09，19，29，39，49</p>
                            </section>
                            <section>
                                <strong>七、【连尾】</strong>
                                <p>· 尾数所对应的号码和尾数项目的一样；一个尾数对应多个号码，不论同尾数的号码出现一个或多个，派彩只派一次。每个尾数都有自己的赔率，下注组合的总赔率，取该组合尾数的最低赔率为总赔率。</p>
                                <span>· [二尾连中]：</span>
                                <p>选择二个尾数为一投注组合进行下注。该注的二个尾数必须在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                                <span>· [三尾连中]]：</span>
                                <p>每三个号码为一组合：若三个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如03、04、05三个都是开奖号码之正码，视为中奖，如两个正码加上一个特码视为不中奖。</p>
                                <span>· [四尾连中]：</span>
                                <p>每二个码号为一组合：二个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖（含一个正码加一个特码之情形）。</p>
                                <span>· [二尾连不中]：</span>
                                <p>选择二个尾数为一投注组合进行下注。该注的二个尾数必须没在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                                <span>· [三尾连不中]：</span>
                                <p>选择三个尾数为一投注组合进行下注。该注的三个尾数必须没在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                                <span>· [四尾连不中]：</span>
                                <p>选择四个尾数为一投注组合进行下注。该注的四个尾数必须没在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                            </section>
                            <section>
                                <strong>八、【一肖】</strong>
                                <p>· 以特码色波和特码单双大小为一个投注组合，当开出特码符合投注组合，即视为中奖。若开出特码为49号时，所有投注半波任一个组合视为和局，其余情况视为不中奖。</p>
                                <p>[鼠] 10、22、34、46</p>
                                <p>[牛] 09、21、33、45</p>
                                <p>[虎] 08、20、32、44</p>
                                <p>[兔] 07、19、31、43</p>
                                <p>[龙] 06、18、30、42</p>
                                <p>[蛇] 05、17、29、41</p>
                                <p>[马] 04、16、28、40</p>
                                <p>[羊] 03、15、27、39</p>
                                <p>[猴] 02、14、26、38</p>
                                <p>[鸡] 01、13、25、37、49</p>
                                <p>[狗] 12、24、36、48</p>
                                <p>[猪] 11、23、35、47</p>
                            </section>
                            <section>
                                <strong>九、【连肖】</strong>
                                <p>· 生肖所对应的号码和特码生肖项目的一样；一个生肖对应多个号码，不论同生肖的号码出现一个或多个，派彩只派一次。每个生肖都有自己的赔率，下注组合的总赔率，取该组合生肖的最低赔率为总赔率。</p>
                                <span>· [二肖连中]：</span>
                                <p>选择二个生肖为一投注组合进行下注。该注的二个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                                <span>· [三肖连中]]：</span>
                                <p>选择三个生肖为一投注组合进行下注。该注的三个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                                <span>· [四肖连中]：</span>
                                <p>选择四个生肖为一投注组合进行下注。该注的四个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                                <span>· [二肖连不中]：</span>
                                <p>选择二个生肖为一投注组合进行下注。该注的二个生肖必须没在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                                <span>· [三肖连不中]：</span>
                                <p>选择三个生肖为一投注组合进行下注。该注的三个生肖必须没在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                                <span>· [四肖连不中]：</span>
                                <p>选择四个生肖为一投注组合进行下注。该注的四个生肖必须没在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                            </section>
                            <section>
                                <strong>十、【特码生肖】</strong>
                                <p>· 当期开奖的特码对应的生肖是投注选择的生肖，即为中奖，否则为不中奖，49号不算和。如投注特肖"鸡"，若开出特码为01 13 25 37 49中的任一个，则中奖，否则不中奖。</p>
                            </section>
                            <section>
                                <strong>十一、【不中】</strong>
                                <p>· 每个号码都有自己的赔率，下注组合的总赔率，取该组合号码的最低赔率为赔率。</p>
                                <span>· [五不中]：</span>
                                <p>所投注的每五个号码为一注，每注的五个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：6,7,8,9,10,11,12，若你投的是1,2,3,4,5则中奖，而投1,2,3,4,6则不中奖。</p>
                                <span>· [六不中]]：</span>
                                <p>所投注的每六个号码为一注，每注的六个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：7,8,9,10,11,12,13，若你投的是1,2,3,4,5,6则中奖，而投1,2,3,4,5,7则不中奖。</p>
                                <span>· [七不中]：</span>
                                <p>所投注的每七个号码为一注，每注的七个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：8,9,10,11,12,13,14，若你投的是1,2,3,4,5,6,7则中奖，而投1,2,3,4,5,6,8则不中奖。</p>
                                <span>· [八不中]：</span>
                                <p>所投注的每八个号码为一注，每注的八个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：9,10,11,12,13,14,15，若你投的是1,2,3,4,5,6,7,8则中奖，而投1,2,3,4,5,6,7,9则不中奖。</p>
                                <span>· [九不中]：</span>
                                <p>所投注的每九个号码为一注，每注的九个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：10,11,12,13,14,15,16，若你投的是1,2,3,4,5,6,7,8,9则中奖，而投1,2,3,4,5,6,7,8,10则不中奖。</p>
                                <span>· [十不中]：</span>
                                <p>所投注的每十个号码为一注，每注的十个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：11,12,13,14,15,16,17，若你投的是1,2,3,4,5,6,7,8,9,10则中奖，而投1,2,3,4,5,6,7,8,9,11则不中奖。</p>
                            </section>
                            <section>
                                <strong>十二、【正码1-6】</strong>
                                <span>· [正码1-6大小]：</span>
                                <p>开出之正码大于或等于25为「大」，小于或等于24为「小」，49为「和」，不计算结果。</p>
                                <span>· [正码1-6单双]：</span>
                                <p>开出之正码为偶数叫「双」，为奇数叫「单」，49为「和」，不计算结果。</p>
                                <span>· [正码1-6尾大小]：</span>
                                <p>特尾小(0-4)：开出之正码尾数，特尾大(5-9)：开出之正码尾数，49号为和局，不计算结果。</p>
                                <span>· [正码1-6合大小]：</span>
                                <p>开出的正码的个位数加上十位数之和大于等于7为「合大」，小于等于6为「合小」，其中号码49为「和」，不计算结果。例如：合大，正码两个数相加大于等于7，例如18；合小，正码两个数相加小于等于6，例如15。</p>
                                <span>· [正码1-6合单双]：</span>
                                <p>开出的正码的个位数加上十位数之和为奇称「合数单」，之和为偶称「合数双」，其中号码49为「和」，不计算结果。例如：合数单，01为0+1=1，23为2+3=5；合数双，28为2+8=10，39为3+9=12；49为和。</p>
                                <span>· [正码1-6半波]：</span>
                                <p>开出之正码所属的颜色。<br/>
                                    01，02，07，08，12，13，18，19，23，24，29，30，34，35，40，45，46为「红波」，<br/>
                                    03，04，09，10，14，15，20，25，26，31，36，37，41，42，47，48为「蓝波」，<br/>
                                    05，06，11，16，17，21，22，27，28，32，33，38，39，43，44，49为「绿波」。<br/>
                                </p>
                            </section>
                            <section>
                                <strong>十三、【龙虎1-6】</strong>
                                <span>· [龙虎1-6]：</span>
                                <p>开出的正码1-6号码数值比较，前面大于后面的为「龙」；反之，后面大于前面为「虎」；如：正码1-6开出号码为13、25、2、7、15、32，则1-2（虎），1-3（龙），1-4（龙），1-5（虎），1-6（虎），2-3(龙），2-4（龙），2-5（龙），2-6（虎），3-4（虎），3-5（虎），3-6（虎），4-5（虎）4-6（虎）5-6（虎），下注与之对应为中奖，其余为不中。</p>
                            </section>
                        </li>
                    </ol>
                    <!--骰宝-->
                    <ol class="list" v-if="gameId == 40">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section>
                                <p>该游戏全天24小时开奖，每五分钟一期，全天共288期。</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong>一、【猜数字】多选</strong>
                                <p>· 第一骰 ~ 第三骰：第一骰、第二骰、第三骰：指下注的每一骰与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一骰开出5，下注第一骰为5者视为中奖，其余情形视为不中奖。</p>
                                <p>· 1~10名猜组合：竞猜内容为「大单」「小双」「小单」「大双」，共4种。</p>
                            </section>
                            <section>
                                <strong>二、【猜双面】单选</strong>
                                <p>· 大小：根据相应单项投注的第一骰 ~ 第三骰开出的数字「大于」或「等于」4为大，「小于」或「等于」3为小。</p>
                                <p>· 单双：根据相应单项投注的第一骰 ~ 第三骰开出的数字为「双数」叫双--如2、6；数字为「单数」叫单--如1、3。</p>
                            </section>
                            <section>
                                <strong>三、【猜总和】</strong>
                                <p>· 总和大小：根据相应单项投注的第一骰 ~ 第三骰开出的骰子数字总和值「大于」或「等于」11为「总和大」，范围为11~17；「小于」或「等于」10为「总和小」，范围为4~10。</p>
                                <p>· 总和单双：根据相应单项投注的第一骰 ~ 第三骰开出的骰子数字总和值是「双数」为「总和双」，数字总和值是「单数」为「总和单」。</p>
                                <span>· 3和18不属于总和开奖范围。</span>
                            </section>
                            <section>
                                <strong>四、【猜对子】多选</strong>
                                <p>· 对1：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子1，顺序不限。如开出结果为1，1，2即为中奖。</p>
                                <p>· 对2：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子2，顺序不限。如开出结果为1，2，2即为中奖。</p>
                                <p>· 对3：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子3，顺序不限。如开出结果为3，2，3即为中奖。</p>
                                <p>· 对4：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子4，顺序不限。如开出结果为4，2，4即为中奖。</p>
                                <p>· 对5：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子5，顺序不限。如开出结果为6，5，5即为中奖。</p>
                                <p>· 对6：根据相应单项投注双骰的第一骰 ~ 第三骰中至少包含两个数字骰子6，顺序不限。如开出结果为3，6，6即为中奖。</p>
                            </section>
                            <section>
                                <strong>五、【猜围骰】多选</strong>
                                <p>· 豹子1：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子1，顺序不限。如开出结果为1，1，1即为中奖。</p>
                                <p>· 豹子2：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子2，顺序不限。如开出结果为2，2，2即为中奖。</p>
                                <p>· 豹子3：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子3，顺序不限。如开出结果为3，3，3即为中奖。</p>
                                <p>· 豹子4：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子4，顺序不限。如开出结果为4，4，4即为中奖。</p>
                                <p>· 豹子5：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子5，顺序不限。如开出结果为5，5，5即为中奖。</p>
                                <p>· 豹子6：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个数字骰子6，顺序不限。如开出结果为6，6，6即为中奖。</p>
                            </section>
                            <section>
                                <strong>六、【猜全围】多选</strong>
                                <p>· 豹子1，豹子2，豹子3，豹子4，豹子5，豹子6：根据相应单项投注三骰的第一骰 ~ 第三骰中包含三个相同骰子即为中奖，顺序不限。如开出结果为1，1，1即为中奖。</p>
                            </section>
                            <section>
                                <strong>七、【猜单骰】多选</strong>
                                <p>· 1：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子1即为中奖，顺序不限。如开出结果为1，2，2即为中奖。</p>
                                <p>· 2：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子2即为中奖，顺序不限。如开出结果为1，2，2即为中奖。</p>
                                <p>· 3：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子3即为中奖，顺序不限。如开出结果为1，2，3即为中奖。</p>
                                <p>· 4：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子4即为中奖，顺序不限。如开出结果为1，4，2即为中奖。</p>
                                <p>· 5：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子5即为中奖，顺序不限。如开出结果为5，2，2即为中奖。</p>
                                <p>· 6：根据相应单项投注单骰的第一骰 ~ 第三骰中包含数字骰子6即为中奖，顺序不限。如开出结果为6，6，6即为中奖。</p>
                            </section>
                            <section>
                                <strong>八、【猜双骰】多选</strong>
                                <p>· 1，2：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子1和2即为中奖，顺序不限。如开出结果为1，2，2即为中奖。</p>
                                <p>· 1，3：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子1和3即为中奖，顺序不限。如开出结果为1，2，3即为中奖。</p>
                                <p>· 1，4：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子1和4即为中奖，顺序不限。如开出结果为1，3，4即为中奖。</p>
                                <p>· 1，5：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子1和5即为中奖，顺序不限。如开出结果为1，5，1即为中奖。</p>
                                <p>· 1，6：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子1和6即为中奖，顺序不限。如开出结果为1，2，6即为中奖。</p>
                                <p>· 2，3：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子2和3即为中奖，顺序不限。如开出结果为1，2，3即为中奖。</p>
                                <p>· 2，4：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子2和4即为中奖，顺序不限。如开出结果为1，2，4即为中奖。</p>
                                <p>· 2，5：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子2和5即为中奖，顺序不限。如开出结果为5，2，5即为中奖。</p>
                                <p>· 2，6：根据相应单项投注双骰的第一骰~第三骰中包含数字骰子2和6即为中奖，顺序不限。如开出结果为6，2，2即为中奖。</p>
                                <p>· 3，4：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子3和4即为中奖，顺序不限。如开出结果为1，3，4即为中奖。</p>
                                <p>· 3，5：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子3和5即为中奖，顺序不限。如开出结果为5，3，2即为中奖。</p>
                                <p>· 3，6：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子3和6即为中奖，顺序不限。如开出结果为2，6，3即为中奖。</p>
                                <p>· 4，5：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子4和5即为中奖，顺序不限。如开出结果为1，5，4即为中奖。</p>
                                <p>· 4，6：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子4和6即为中奖，顺序不限。如开出结果为4，2，6即为中奖。</p>
                                <p>· 5，6：根据相应单项投注双骰的第一骰 ~ 第三骰中包含数字骰子5和6即为中奖，顺序不限。如开出结果为4，6，5即为中奖。</p>
                            </section>
                        </li>
                    </ol>
                    <!--牛牛-->
                    <ol class="list" v-if="gameId == 50">
                        <li>
                            <h3 class="title"><i></i>游戏介绍</h3>
                            <section>
                                <p>游戏使用扑克牌中52张牌（不含鬼牌），开奖结果为5张随机牌，共2组，每天24小时不间断开奖，五分钟一期，全天共288期；<br/>开奖结果的五张牌面大小顺序为 A<2<3<4<5<6<7<8<9<10，花色大小顺序为 黑桃>红心>梅花>方块；J,Q,K为公牌，计算总和J,Q,K大小分别为11，12，13；两组牌面点数大小顺序为 无牛 < 牛一 < 牛二 < 牛三 < 牛四 < 牛五 < 牛六< 牛七 < 牛八 < 牛九 < 牛牛 < 花色牛。<br/>从5张牌中找出3张可成10或10的倍数组合则判定「有牛」，再根据剩余2张牌相加，如遇点数相加超过10点则减去10点，最后的点数则对应不同的结果；若从5张牌中任意找出3张都不能成为10或10的倍数组合则判定为「无牛」。</p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>玩法介绍</h3>
                            <section>
                                <strong>一、【猜牛牛】</strong>
                                <p>· 指下注与胜方开出之结果相同，视为中奖；如胜方开出的结果为「牛八」，下注为「牛八」者视为中奖，其余情形视为不中奖。</p>
                            </section>
                            <section>
                                <strong>二、【猜牌面】</strong>
                                <p>· 第一张牌~第五张牌：第一张牌，第二张牌，第三张牌，第四张牌，第五张牌：指下注与胜方开出之结果其开奖顺序及开奖结果相同，视为中奖，如胜方第一张牌开出「8」，下注第一张牌为「8」者视为中奖，其余情形视为不中奖。</p>
                            </section>
                            <section>
                                <strong>三、【猜双面】</strong>
                                <p>· 大小：根据胜方相应单项投注的第一张牌 ~ 第五张牌开出的牌面「大于」或「等于」7为大，「小于」或「等于」6为小。</p>
                                <p>· 单双：根据胜方相应单项投注的第一张牌 ~ 第五张牌开出的牌面为「双数」叫双；如2、6；牌面为「单数」叫单；如A、3。</p>
                            </section>
                            <section>
                                <strong>四、【猜花色】</strong>
                                <p>· 第一张牌~第五张牌：第一张牌，第二张牌，第三张牌，第四张牌，第五张牌：指下注与胜方开出之结果其开奖顺序及开奖结果相同，视为中奖，如胜方第一张牌开出「黑桃」，下注第一张牌为「黑桃」者视为中奖，其余情形视为不中奖。</p>
                            </section>
                            <section>
                                <strong>五、【猜龙虎】</strong>
                                <p>· 胜方第一张牌的大小「大于」第五张牌的大小为「龙」，胜方第一张牌的大小「小于」第五张牌的大小为「虎」；牌面大小相同时比较花色大小。</p>
                            </section>
                            <section>
                                <strong>六、【猜公牌】</strong>
                                <p>· 胜方五张牌中是否含有公牌，有则为「有公牌」，无则为「无公牌」。</p>
                            </section>
                            <section>
                                <strong>七、【猜总和】</strong>
                                <p>· 大小：根据胜方五张牌开出的牌面总和「大于」或「等于」35为大，「小于」或「等于」34为小。</p>
                                <p>· 单双：根据胜方五张牌开出的牌面总和为「双数」叫双；如34、36；牌面总和为「单数」叫单；如7、11。</p>
                            </section>
                            <section>
                                <strong>八、【猜胜负】</strong>
                                <p>· 红方的点数大于蓝方则为「红方胜」，反之「蓝方胜」。</p>
                            </section>
                        </li>
                    </ol>
                    <!--跟单说明-->
                    <ol class="list" v-if="gameId == 888">
                        <li>
                            <h3 class="title"><i></i>跟单说明</h3>
                            <section>
                                <p>
                                    1、本平台注册用户,申请成为大神后即有资格进行发单。<br/>
                                    2、发单者所发单中奖,并[奖金-(奖金*发单提成)]>投注金,则有佣金 提成。<br/>
                                    3、几中几:指发单者近10期已开奖发单方案数量及中奖方案数量。<br/>
                                    4、胜率:指发单者在本平台发单10期记录中的红单数与总购彩单数的百分比,其中 总购彩单数包括“非跟单”订单。<br/>
                                    5、订单排序:根据订单当前的(跟单金额/自购金额)大小进行排序,该数值越大, 排的越前。<br/>
                                    6、发单目前支持本平台所有彩种。
                                </p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>如何发单</h3>
                            <section style="box-shadow: none;">
                                <strong>一、【发单介绍】</strong>
                               <p>
                                   1、选择投注内容后点击“加入注单”按钮后勾选“发单”进入发单详情。<br/>
                                   2、发单页面可进行佣金的设置,为0%-10%;方案有公开、开奖后公开、保密三种保密设置;“方案描述”中填写的內容将在跟单页面进行展示,请谨慎填写。<br/>
                                   3、点击“确认发单”按钮，付款即完成发单。
                               </p>
                            </section>
                        </li>
                        <li>
                            <h3 class="title"><i></i>佣金介绍</h3>
                            <section style="box-shadow: none;">
                                <strong>一、【如何获得佣金】</strong>
                                <p>
                                    1、发单时,可选择0%-10%的佣金提成。<br/>
                                    2、必须是中奖的跟单,且[奖金-(奖金*发单提成)]>投注金,才有佣金提成。<br/>
                                    3、跟单者跟投方案中奖后,则从该方案奖金里扣除发单者所设佣金并返于发单者。<br/>
                                </p>
                                <p>本规则最终解释权归本平台所有，如果有疑问请联系客服</p>
                            </section>
                        </li>
                    </ol>
                    <!--活动详情-->
                    <ol class="list" v-if="gameId == 666">
                        <li>
                            <h3 class="title"><i></i>活动详情<em>2019-01-19 19:09</em></h3>
                            <section>
                                <p>
                                    天天签到周周送<br/>
                                    签到7天：存款要求/每天500元，可获奖金88元<br/>
                                    签到7天：存款要求/每天2000元，可获奖金128元<br/>
                                    签到7天：存款要求/每天5000元，可获奖金258元<br/>
                                    签到7天：存款要求/每天10000元，可获奖金388元<br/>
                                    签到7天：存款要求/每天30000元，可获奖金588元<br/>
                                    签到7天：存款要求/每天50000元，可获奖金888元<br/>
                                    签到7天：存款要求/每天100000元，可获奖金1888元<br/>
                                    签到7天：存款要求/每天500000+元，可获奖金5888元<br/>
                                    条件：此优惠可以与其他优惠同时进行，本公司保持最终解释权<br/>
                                    周期：每周一0:00至每周日23:59为一个周期;<br/>
                                    申请：达到条件的用户，可以直接联系在线客服申请;<br/>
                                    警告：三无玩家不可享用此优惠不可以刷水、套利等行为。
                                </p>
                            </section>
                        </li>
                    </ol>
                </div>
            </scroller>
        </div>
    </section>
</template>

<script>
    const TrayHeader = import('../public/rn-header')
    export default {
        name: "RulesPlay",
        components: {
            TrayHeader () {
                return {
                    component: TrayHeader
                }
            }
        },
        data () {
            return {
                gameId: '', // 游戏ID
                title: ''
            }
        },
        created () {
            this.gameId = this.$route.query.id, this.title = this.$route.query.title
            if (!this.gameId) this.gameId = 20, this.title = '北京PK10'
        }
    }
</script>

<style scoped lang="scss">
    .ruleDetails {
        height: 100%; background: #f7f7f7;
        .scroX {
            height: calc(100% - 90px);
        }
        .list li {
            margin-bottom: 20px; background: white;
            .title {
                height: 100px; padding: 0 20px; color: #333; font-size: 28px; line-height: 100px; box-shadow: 0 1px #d2d2d2;
                i {
                    float: left; width: 6px; margin: 32px 20px 0 0; height: 36px; background: #d9342f;
                }
                em {
                    float: right; color: #999; font-size: 24px;
                }
            }
            section {
                padding: 15px 20px; box-shadow: 0 1px #d2d2d2;
                strong, span {
                    display: block; color: #d9342f; font-size: 26px;
                }
                span {
                    margin: 10px 0 2px;
                }
                p { padding: 0; color: #333; font-size: 26px; text-align: justify; line-height: 42px; }
                p:nth-child(2) { padding: 15px 0 0; }
            }
        }
        .list li:first-child section {
            box-shadow: 0 0;
        }
    }
</style>
