<template>
    <p style="margin-bottom:12px">活动内容：
<br>易趣彩票新手彩金，当月注册！当月存款！即可参与送大礼存款彩金最高888元</p>
    <table>
        <thead>
            <td>阶级</td>
            <td>负盈利</td>
            <td>翻本彩金</td>
            <td>申请时间</td>
            <td>提款要求</td>
        </thead>
        <tr>
            <td>300+</td>
            <td rowspan="3">10%</td>
            <td rowspan="3">888</td>
            <td rowspan="3">13倍</td>
        </tr>
        <tr>
            <td>1000+</td>
        </tr>
        <tr>
            <td>3000+</td>
        </tr>
    </table>
    <p style="margin-top:11px;margin-bottom:9px;">申请方式：
    <br>10%彩金联系在线客服或微信客服申请。
    </p>
    <p>优惠规则：
<br>1、该活动只限当月注册，当月存款的新会员参与。
<br>2、获得10%彩金只需13倍流水即可申请提款，例：（1,000+100）*13=14,300即可申请提款。
<br>3、该活动存款不能与其他优惠活动共享。
<br>4、该活动彩金可与其它优惠共享。
<br>5、相同IP地址（包含登录IP和游戏IP）、相同安全信息（银行卡）的用户仅可申请一次，如果发现重复申请或者利用多账户或其他方式对打套利，易趣彩票拒绝赠送彩金、并扣除其盈利。
<br>6、活动最终解释权归易趣彩票所有，易趣彩票有暂停、终止、修改等权利。</p>
</template>
